app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @article = Article.find(params[:id])

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2019-02-03 18:26:16.015626"], ["updated_at", "2019-02-03 18:26:16.015626"]]
---
  def create
    @article = Article.new
    @article.title = params[:title]
    @article.description = params[:description]
    @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @article = Article.find(params[:id])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-02-03 19:37:23.427382"], ["id", 1]]
---
  def update
    # byebug
    @article = Article.find(params[:id])
    @article.update(params[:article])